month = int(input("Введите номер месяца: "))

l = ["Зима", "Весна", "Лето", "Осень"]
d = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето",
     7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

if month == 1 or month == 2 or month == 12:
    print("Результат через список: " + l[0])
elif month == 3 or month == 4 or month == 5:
    print("Результат через список: " + l[1])
elif month == 6 or month == 7 or month == 8:
    print("Результат через список: " + l[2])
elif month == 9 or month == 10 or month == 11:
    print("Результат через список: " + l[3])

print("Результат через словарь: " + d[month])
